# Exporter IFC Remove Building Storey Method

Source: https://www.revitapidocs.com/2026/e1dada57-54f4-ecbb-d3bf-75144f65c34e.htm

---

| Exporter IFC Remove Building Storey Method |
| --- |

**Note: This API is now obsolete.**

Removes an IFCLevelInfo corresponding to a level from the exporter's internal cache.
**Namespace:** Autodesk.Revit.DB.IFC
**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById instead.")]
public void RemoveBuildingStorey(
	ElementId id
)
```

```
<ObsoleteAttribute("This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById instead.")>
Public Sub RemoveBuildingStorey (
	id As ElementId
)
```

```
public:
[ObsoleteAttribute(L"This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById instead.")]
void RemoveBuildingStorey(
	ElementId^ id
)
```

```
[<ObsoleteAttribute("This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById instead.")>]
member RemoveBuildingStorey :
        id : ElementId -> unit
```

#### Parameters

id ElementId
:   The level id.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

ExporterIFC Class Autodesk.Revit.DB.IFC Namespace